TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/гкс_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.гкс_ЗаданияНаКомпозитныеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ФактическиеПоказателиКачества</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыРегистрации</registerRecords>
  <attributes>
    <name>ВидЛабораторногоАнализа</name>
    <type>
      <types>CatalogRef.гкс_ВидыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПолученияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СостояниеТранспортногоСредства</name>
    <type>
      <types>EnumRef.гкс_СоответствиеТребованиям</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСертификация</name>
    <type>
      <types>DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонениеОтБазиса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <comment>ERP-1475</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСоотвествия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсиленныйКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗначениеВнешнейПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяПроба</name>
      <type>
        <types>DocumentRef.гкс_ВнешняяПроба</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяСуммаВнешнейПробы</name>
      <comment>Контрольная сумма MD5</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиДляПерепроверки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользованияКачества</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиПечатиФормированияПроб/гкс_НастройкиПечатиФормированияПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиПечатиФормированияПроб</name>
  <resources>
    <name>КоличествоЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <comment>ERP-1220</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</name>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеКачества</name>
    <type>
      <types>EnumRef.гкс_СостоянияКачества</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_МинимальныеПоказателиКачестваПриемки/гкс_МинимальныеПоказателиКачестваПриемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_МинимальныеПоказателиКачестваПриемки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокДляПриемки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СтатусыЛабораторногоАнализа/гкс_СтатусыЛабораторногоАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СтатусыЛабораторногоАнализа</name>
  <enumValues>
    <name>ОтборПробы</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтмена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполнить объект значениями по умолчанию.
//
Процедура ЗаполнитьОбъектЗначениямиПоУмолчанию() Экспорт
	
	Если Не ЗначениеЗаполнено(гкс_МестнаяДата) И ЗначениеЗаполнено(ТочкаМаршрута) Тогда
		
		ЧасовойПояс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");
		
		Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
			гкс_МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПояс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоличествоОбразцов) Тогда
		КоличествоОбразцов = 
			РегистрыСведений.гкс_НастройкиПечатиФормированияПроб.КоличествоОбразцовПробПоПараметрамОтбора(
				Номенклатура, ТочкаМаршрута, гкс_ВидПеревозки, гкс_НазначениеИспользованияКачества);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы;
	КонецЕсли;	
	
КонецПроцедуры

// Заполняет табличную часть "Качественные показатели" значениями из соотвествия с средневзвешенными показателями
// предварительно табличная часть показателей должна быть заполнена по спецификации композитного анализа.
// показатели не добавленные в спецификацию не учитываются.
//
// Параметры:
//   СредневзвешенныеПоказатели - Соответствие - средневзвешенные значения показателей
//
Процедура ЗаполнитьСредневзвешенныеПоказатели(СредневзвешенныеПоказатели) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьСредневзвешенныеПоказатели") Тогда
		Возврат;	
	КонецЕсли;	

	Для Каждого КлючЗначение Из СредневзвешенныеПоказатели Цикл
				
		Показатель = КлючЗначение.Ключ;	
		НайденнаяСтрока	= КачественныеПоказатели.Найти(Показатель, "Показатель");
		Если НайденнаяСтрока <> Неопределено Тогда		
			НайденнаяСтрока.Значение = КлючЗначение.Значение;
		КонецЕсли;
	
	КонецЦикла;
	
	ПроверитьСоотвествиеКачеству();
	
КонецПроцедуры

// Проводит проверку соотвествия фактических значений анализов с нормативными показателями спецификации
// и показателями усиленного контроля
// 
// Параметры:
//  Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатетель по которому будет производится
//	проверка соотвествия нормативам
//
Процедура ПроверитьСоотвествиеКачеству(Показатель = Неопределено) Экспорт 
	
	МинимальноеКачествоПриемкиПоставщика = МинимальныеЗначенияКачестваПриемкиПоставщика();
	
	ДопустимыеИнтервалыНормативнойСпецификации = гкс_РаботаСПоказателямиНоменклатуры.
		ДопустимыеИнтервалыНормативнойСпецификации(ТочкаМаршрута, гкс_ВидПеревозки, 
		Номенклатура, ДатаАнализа(), гкс_НазначениеИспользованияКачества, НормативнаяСертификация);
		
	ДопустимыеИнтервалыУсиленногоКонтроля = ДопустимыеИнтервалыУсиленногоКонтроля();
	
	Если ЗначениеЗаполнено(Показатель) Тогда
		Строка = КачественныеПоказатели.Найти(Показатель, "Показатель");
		ПроверитьСтрокуАнализаСоответствиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
			ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика);
	Иначе
		Для Каждого Строка Из КачественныеПоказатели Цикл
			ПроверитьСтрокуАнализаСоответствиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
				ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

// Заполнить список качественных показателей для дальнейшего исследования.
//
Процедура ЗаполнитьПоказателиДляИсследования() Экспорт
		
	КачественныеПоказатели.Очистить();
	ПоказателиДляПерепроверки.Очистить();
			
	ЗаполнитьПоказателямиНормативными();
	ЗаполнитьПоказателямиУсиленногоКонтроля();
	ЗаполнитьДанныеВнешнихПроб();
						
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработка заполнения.
// 
// Параметры:
//  ДанныеЗаполнения - Произвольный - Данные заполнения
//  ТекстЗаполнения - Строка, Неопределено - Текст заполнения
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		гкс_ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
		
		МассивПоказателей = Неопределено;			
		Если ДанныеЗаполнения.Свойство("МассивПоказателей", МассивПоказателей) Тогда	
			ЗаполнитьКачественныеПоказателиДанными(МассивПоказателей);			
		КонецЕсли;
		
	КонецЕсли;	
			
КонецПроцедуры

// Обработчик "Перед записью".
// 
// Параметры:
//  Отказ - Булево - Отказ
//  РежимЗаписи - РежимЗаписиДокумента - Режим записи
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
	     И Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен 
	     И Не Пользователи.ЭтоПолноправныйПользователь() Тогда
	
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Выполнять отмену проведения документа в статусе ""Выполнен"" разрешено только администратору'"));
	
	КонецЕсли;
	
	ЗаполнитьОбъектЗначениямиПоУмолчанию();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
		
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДополнительныеСвойства.Вставить("СоответствуетНормативу", СоответствуетНормативу());
	КонецЕсли;
		
КонецПроцедуры

// Обработчик "При записи".
// 
// Параметры:
//  Отказ - Булево - Отказ
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработка проведения.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ИнициализироватьДопПараметры(ДопПараметры);
	
	// Заполнение РС показателей усиленного контроля
	Если Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен Тогда
		ЗаполнитьРегистрПоказателейУсиленногоКонтроля();
	КонецЕсли;	
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
										
	ЭтоПерепроверкаВнешнихПроб = Перечисления.гкс_НазначенияИспользованияКачества
									.ЭтоПерепроверкаВнешнихПроб(гкс_НазначениеИспользованияКачества);									
	
	Если Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен Тогда
		
		Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС")
			И ЭтоПриемкаПромежуточныйКомпозит() Тогда
			
			// формирование документов для текущей регистрации
			ЗаполнитьРегистрЗаблокированныеРегистрацииПЛК();
			
			// документы для Заблокированных  регистрацией/ группой ТС данных
			СформироватьВспомогательныеДанныеДляЗаблокированныхТС();	
		КонецЕсли;
		
		Если ЭтоПриемкаПромежуточныйКомпозит() И ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации) Тогда			
			СформироватьНаправлениеНаРазгрузкуПриНеобходимости(гкс_ДокументРегистрации, Ссылка, Дата, ДопПараметры);
		КонецЕсли;
		
		Если ЭтоПриемкаПриемкаКомпозит() Тогда	
			гкс_ПриемкаТранспорта.ПерезаполнитьОснованияПриИзмененииАнализа(Ссылка, Отказ);		
		КонецЕсли;
	КонецЕсли;
			
	Если Не Отказ
		И (ЭтоПриемкаПромежуточныйКомпозит() И ДополнительныеСвойства.Свойство("ЭтоНомерПробы")
		ИЛИ ЭтоПерепроверкаВнешнихПроб) Тогда
		
		Если ЭтоФормированиеНомераПроб(гкс_ДокументРегистрации) Тогда
			
			МассивРегистраций = Документы.гкс_ФормированиеНомераПробы
				.ДокументыРегистрацииФормированияНомераПроб(гкс_ДокументРегистрации);
			
  			Для Каждого ДокументРегистрации Из МассивРегистраций Цикл	
				гкс_ПриемкаТранспортаВызовСервера.
					РассчитатьДанныеРегистрацииДляРМПриемкаТранспорта(ДокументРегистрации);
			КонецЦикла;	
		Иначе	
			гкс_ПриемкаТранспортаВызовСервера.
				РассчитатьДанныеРегистрацииДляРМПриемкаТранспорта(гкс_ДокументРегистрации);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСтрокуАнализаСоответствиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
			ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика); 
		
	Если Строка.УсиленныйКонтроль Тогда
		Если ДопустимыеИнтервалыУсиленногоКонтроля <> Неопределено Тогда
			ДопустимыйИнтервалУК  = ДопустимыеИнтервалыУсиленногоКонтроля.Найти(Строка.Показатель, "Показатель"); 
		Иначе
			ДопустимыйИнтервалУК = Неопределено;
		КонецЕсли;	
		
		ПроверитьВхождениеВИнтервалКачества(Строка, ДопустимыйИнтервалУК);		
	Иначе
		
		Если Не ПроверкаМинимальногоКачестваПриемкиПоставщика(Строка, МинимальноеКачествоПриемкиПоставщика) Тогда
			
			Если ДопустимыеИнтервалыНормативнойСпецификации <> Неопределено Тогда
				ДопустимыйИнтервалНорм = ДопустимыеИнтервалыНормативнойСпецификации.Найти(Строка.Показатель, "Показатель");
			Иначе
				ДопустимыйИнтервалНорм = Неопределено;
			КонецЕсли;	
				
			ПроверитьВхождениеВИнтервалКачества(Строка, ДопустимыйИнтервалНорм);
		КонецЕсли;	
		
	КонецЕсли;
		  	
КонецПроцедуры

Функция ПроверкаМинимальногоКачестваПриемкиПоставщика(СтрокаЛабАнализа, МинимальноеКачествоПриемкиПоставщика)
	
	Если МинимальноеКачествоПриемкиПоставщика = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	МинимальноеКачествоПриемки = МинимальноеКачествоПриемкиПоставщика.Найти(СтрокаЛабАнализа.Показатель, "Показатель");
	
	Если МинимальноеКачествоПриемки <> Неопределено И СтрокаЛабАнализа.Значение <> 0 Тогда

		Если СтрокаЛабАнализа.Значение < МинимальноеКачествоПриемки.ЗначениеПоказателя Тогда

			СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
			СтрокаЛабАнализа.ОтклонятьКачество = МинимальноеКачествоПриемки.ОтклонятьКачество;

			СтрокаЛабАнализа.КомментарийСоотвествия = СтрШаблон("%1 (%2)", 
				МинимальноеКачествоПриемки.Комментарий,
				МинимальноеКачествоПриемки.ЗначениеПоказателя);
		Иначе
			СтрокаЛабАнализа.СоответствуетНормативу = Истина;
			СтрокаЛабАнализа.КомментарийСоотвествия = "";
		КонецЕсли;
		
		Результат = Истина;	
	Иначе	
		Результат = Ложь;		
	КонецЕсли;	         
	
	Возврат Результат;
	
КонецФункции	
	
Процедура ПроверитьВхождениеВИнтервалКачества(СтрокаЛабАнализа, ДопустимыйИнтервал)
	
	Если ДопустимыйИнтервал = Неопределено Тогда
		СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
		СтрокаЛабАнализа.ОтклонятьКачество = Истина;
		СтрокаЛабАнализа.КомментарийСоотвествия = ?(СтрокаЛабАнализа.УсиленныйКонтроль,
			"Не установлены ограничения по усиленному контролю" , "Не установлены нормы на показатель");		
	Иначе
		
		Если СтрокаЛабАнализа.Значение >= ДопустимыйИнтервал.ЗначениеПоказателяМин 
			И СтрокаЛабАнализа.Значение <= ДопустимыйИнтервал.ЗначениеПоказателяМакс Тогда 
			СтрокаЛабАнализа.СоответствуетНормативу = Истина;
			СтрокаЛабАнализа.ОтклонятьКачество = Ложь;
			СтрокаЛабАнализа.КомментарийСоотвествия = "";
		Иначе
			СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
			СтрокаЛабАнализа.ОтклонятьКачество = ДопустимыйИнтервал.ОтклонятьКачество;
		КонецЕсли;
		
		СтрокаЛабАнализа.ОтклонениеОтБазиса = СтрокаЛабАнализа.Значение - ДопустимыйИнтервал.Базис;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСвойствоПроведенияСостоянияРегистрации() Экспорт
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	НужноОтражатьСостояниеРегистрации = Документы.гкс_РегистрацияНаПЛК
		.ОтражатьСостояниеРегистрацииДляЛабораторногоАнализа(гкс_ДокументРегистрации);
	
	Если Не НужноОтражатьСостояниеРегистрации Тогда 
		ДополнительныеСвойства.Вставить("НеОтражатьСостоянияРегистрации", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДокументПослеОбработки(АРМКомпозитныеПробы = Ложь) Экспорт

	Если ПометкаУдаления Тогда
		Записать(РежимЗаписиДокумента.Запись);
	Иначе
		
		Если ЗаполнитьСтатусыЛабораторногоАнализаВыполнен(АРМКомпозитныеПробы) Тогда 
			Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен;
		ИначеЕсли ЗначениеЗаполнено(гкс_ДатаНачалаАнализа) Тогда 
			Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполняется;
		КонецЕсли;
		Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;

КонецПроцедуры

#Область ЗаполнениеДокумента

// Заполнить статусы лабораторного анализа выполнен.
// 
// Параметры:
//  АРМКомпозитныеПробы - Булево - АРМКомпозитные пробы
// 
// Возвращаемое значение:
//  Булево - Заполнить статусы лабораторного анализа выполнен
Функция ЗаполнитьСтатусыЛабораторногоАнализаВыполнен(АРМКомпозитныеПробы)
	Возврат ЗначениеЗаполнено(гкс_ДатаОкончанияАнализа)
			Или НеОжидатьОкончанияАнализаДляВыполнения() 
			Или АРМКомпозитныеПробы;
КонецФункции

Процедура ЗаполнитьПоказателямиНормативными()
	
	НормативныеПоказатели = гкс_РаботаСПоказателямиНоменклатуры.НормативныеПоказатели(
		ТочкаМаршрута, Номенклатура, гкс_ВидПеревозки, гкс_НазначениеИспользованияКачества, Дата);

	Для Каждого ЭлементМассива Из НормативныеПоказатели Цикл	
		НоваяСтрока = КачественныеПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		НоваяСтрока.НомерПробы = НомерПробы;				
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоказателямиУсиленногоКонтроля()
	
	// усиленный контроль 
	Если ЗначениеЗаполнено(гкс_ДокументРегистрации) Тогда	
		ПоказателиУсиленногоКонтроля = гкс_РаботаСПоказателямиНоменклатуры.ПоказателиУсиленногоКонтроля(
			гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);
	Иначе		
		Возврат;	
	КонецЕсли;
		
	Для Каждого ЭлементМассива Из ПоказателиУсиленногоКонтроля Цикл
		
		СтрокаТабЧасти = КачественныеПоказатели.Найти(ЭлементМассива.Показатель, "Показатель");
		Если СтрокаТабЧасти = Неопределено Тогда
			СтрокаТабЧасти = КачественныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, ЭлементМассива, "Показатель, ЕдиницаИзмерения");
			СтрокаТабЧасти.НомерПробы = НомерПробы;
		КонецЕсли;
		
		СтрокаТабЧасти.УсиленныйКонтроль = Истина;
		// приоритет за усиленным контролем
		СтрокаТабЧасти.ИскатьВнешниеПробы = Ложь;
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗаполнитьДанныеВнешнихПроб()
	
	Если Не(ПолучитьФункциональнуюОпцию("гкс_ИспользоватьРезультатыВнешнихПроб")
		И гкс_НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.Приемка) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказателиДляПерепроверки.Очистить();
	ЗаявкаНаПеревозку = Документы.гкс_ЗаявкаНаПеревозку.ПустаяСсылка();
	
	Если КачественныеПоказатели.Найти(Истина, "ИскатьВнешниеПробы") = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЗначенияВнешнейПробы = гкс_РаботаСПоказателямиНоменклатуры.ПоискДокументаВнешнейПробы(гкс_ДокументРегистрации);	
	Если Не ЗначениеЗаполнено(ЗначенияВнешнейПробы) Тогда
		Возврат;
	КонецЕсли;	
		
	НомерИтоговогоУзла = 0;
	ИтоговыйУзел = ЗначенияВнешнейПробы.Строки[НомерИтоговогоУзла];	
		
	Если ИтоговыйУзел.ЕстьВнешний Тогда
		
		// для проверки внешней пробы качеству
		ДопустимыеИнтервалыНормативнойСпецификации = гкс_РаботаСПоказателямиНоменклатуры.
			ДопустимыеИнтервалыНормативнойСпецификации(ТочкаМаршрута, гкс_ВидПеревозки, 
			Номенклатура, ДатаАнализа(), гкс_НазначениеИспользованияКачества, НормативнаяСертификация);
				
		Для Каждого ДанныеВнешнейПробы Из ИтоговыйУзел.Строки Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Показатель", ДанныеВнешнейПробы.Показатель);
			ПараметрыОтбора.Вставить("ИскатьВнешниеПробы", Истина);
            ПараметрыОтбора.Вставить("УсиленныйКонтроль", Ложь);
			
			НайденныеСтроки = КачественныеПоказатели.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;	

			ПерваяСтрока = 0;
			СтрокаТабЧасти = НайденныеСтроки[ПерваяСтрока];
			
			СтрокаТабЧасти.Значение = ДанныеВнешнейПробы.ЗначениеПоказателя;
			СтрокаТабЧасти.ВнешняяПроба = ДанныеВнешнейПробы.ВнешняяПроба;
			СтрокаТабЧасти.КонтрольнаяСуммаВнешнейПробы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДанныеВнешнейПробы.ВнешняяПроба, "КонтрольнаяСумма");
			ЗаявкаНаПеревозку = ДанныеВнешнейПробы.ЗаявкаНаПеревозку;	
			
			Если гкс_ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
				
				ПроверитьСтрокуАнализаСоответствиюКачеству(СтрокаТабЧасти, 
					ДопустимыеИнтервалыНормативнойСпецификации, Неопределено, Неопределено);
				
				Если (Не СтрокаТабЧасти.СоответствуетНормативу) 
					И СтрокаТабЧасти.ОтклонятьКачество Тогда
					
					СтрокаТабЧасти.Значение = 0;
					СтрокаТабЧасти.ИскатьВнешниеПробы = Ложь;
					СтрокаТабЧасти.ЭтоЗначениеВнешнейПробы = Ложь;
					Продолжить;		
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаТабЧасти.ЭтоЗначениеВнешнейПробы = Истина;	
			СтрокаТабЧасти.НомерПробы = "";	
				
		КонецЦикла;	
	Иначе	
		ОбработатьПробаНеНайдена(ИтоговыйУзел.Строки);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработатьПробаНеНайдена(ПоказанияВнешнихПроб)

	ТипыТранспортныхСредств = Перечисления.гкс_ТипыТранспортныхСредствДоставки;
	
	Для Каждого ДанныеВнешнейПробы Из ПоказанияВнешнихПроб Цикл
		
		СтрокаТабЧасти = КачественныеПоказатели.Найти(ДанныеВнешнейПробы.Показатель, "Показатель");
		
		ТекстСообщения = НСтр("ru = 'Не найден результат ""%1"" внешней пробы для подстановки в лабораторный анализ'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ДанныеВнешнейПробы.Показатель);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка);
		
		Если ТипыТранспортныхСредств.ЭтоАвтоПеревозка(гкс_ВидПеревозки) Тогда
			
			СтрокаТабЧасти.ИскатьВнешниеПробы = Ложь;
			
		ИначеЕсли ТипыТранспортныхСредств.ЭтоЖДПеревозка(гкс_ВидПеревозки) Тогда
			
			// добавляем для композита, удаляем из входного
			СтрокаПерепроверки = ПоказателиДляПерепроверки.Добавить();
			СтрокаПерепроверки.Показатель = ДанныеВнешнейПробы.Показатель;
			СтрокаПерепроверки.НазначениеИспользованияКачества = 
				Перечисления.гкс_НазначенияИспользованияКачества.ПерепроверкаВнешнихПроб;
			
			КачественныеПоказатели.Удалить(СтрокаТабЧасти);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьКачественныеПоказателиДанными(МассивПоказателей)
	
	Для Каждого ЭлементМассива Из МассивПоказателей Цикл
		
		СтрокаТабЧасти = КачественныеПоказатели.Найти(ЭлементМассива.Показатель, "Показатель");
		
		Если СтрокаТабЧасти	= Неопределено Тогда
			НоваяСтрока = КачественныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
			
			Если Не НоваяСтрока.ЭтоЗначениеВнешнейПробы Тогда
				НоваяСтрока.НомерПробы = НомерПробы;
			КонецЕсли;	
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область НормативнаяСертификацияИКачественныеПоказатели

Функция ДопустимыеИнтервалыУсиленногоКонтроля()
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная) КАК ТипПробы
		|ПОМЕСТИТЬ ВТ_СписокРегистраций
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
		|		ПО (ЛабораторныйАнализ.Ссылка = &Ссылка)
		|			И (ТИПЗНАЧЕНИЯ(ЛабораторныйАнализ.гкс_ДокументРегистрации) = ТИП(Документ.гкс_ФормированиеНомераПробы))
		|			И ЛабораторныйАнализ.гкс_ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|ГДЕ
		|	ЛабораторныйАнализ.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ЛабораторныйАнализ.гкс_ДокументРегистрации) = ТИП(Документ.гкс_РегистрацияНаПЛК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Базис КАК Базис,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ОтклонятьКачество КАК ОтклонятьКачество
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРегистраций КАК ВТ_СписокРегистраций
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации = ВТ_СписокРегистраций.ДокументРегистрации
		|			И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ВТ_СписокРегистраций.НазначениеИспользованияКачества
		|			И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = ВТ_СписокРегистраций.ТипПробы,
		|	Константа.гкс_ИспользоватьУсиленныйКонтрольКачества КАК ИспользоватьУсиленныйКонтрольКачества
		|ГДЕ
		|	ИспользоватьУсиленныйКонтрольКачества.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения минимальных разрешенных значений для показателей качества поставщика
//
// Возвращаемое значение:
//   ТаблицаЗначений, Неопределено - 
//								 
Функция МинимальныеЗначенияКачестваПриемкиПоставщика()
	
	Результат = Неопределено;
	
	Если Не (ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации)
		И Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(гкс_ДокументРегистрации, "ОтправительПолучатель");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.Показатель КАК Показатель,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ОстатокДляПриемки КАК ОстатокДляПриемки,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ШаблонКомментария КАК Комментарий,
		|	ЛОЖЬ КАК ОтклонятьКачество
		|ИЗ
		|	РегистрСведений.гкс_МинимальныеПоказателиКачестваПриемки.СрезПоследних(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И Номенклатура = &Номенклатура) КАК МинимальныеПоказателиКачестваПриемкиСрезПоследних
		|ГДЕ
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.Действует";
	
	Запрос.УстановитьПараметр("Период", ДатаАнализа());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
    Возврат Результат;

КонецФункции

Функция ДатаАнализа()
	
	Если ЗначениеЗаполнено(гкс_ДатаПолученияАнализа) Тогда
		Результат = гкс_ДатаПолученияАнализа;
	Иначе	  
		Результат = Дата;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Заполнить регистр показателей усиленного контроля по регистрации.
//
// Процедура выполняет дозаполнение поля ЛабораторныйАнализ в регистре сведений
// гкс_ПоказателиУсиленногоКонтроляПоРегистрации для записей, соответствующих
// показателям из табличной части КачественныеПоказатели при проведении документа.
//
// Логика:
//   1. Читает существующие записи регистра по документу регистрации
//   2. Для записей с показателями из ТЧ и незаполненным полем ЛабораторныйАнализ
//   3. Дозаполняет поле ЛабораторныйАнализ ссылкой на текущий документ
//
Процедура ЗаполнитьРегистрПоказателейУсиленногоКонтроля()
	
	// Проверяем условие необходимости усиленного контроля
	Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества")
		И ЭтоПриемкаПромежуточныйКомпозит() Тогда 
	
		гкс_ВходнойКонтрольКачества.ЗаполнитьРегистрПоказателейУсиленногоКонтроляЛабАнализом(
			Ссылка, гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);
			
		гкс_ВходнойКонтрольКачества.ЗаполнитьРегистрПоказателейУсиленногоКонтроляСостояниемКачества(
			Ссылка, гкс_ДокументРегистрации);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрЗаблокированныеРегистрацииПЛК() 
	
	Если ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации)
		И Перечисления.гкс_НазначенияИспользованияКачества
			.ЭтоПромежуточныйКомпозит(гкс_НазначениеИспользованияКачества) Тогда
			
		гкс_ВходнойКонтрольКачества.ОбновитьБлокировкуТекущейРегистрации(гкс_ДокументРегистрации, Ссылка);
	КонецЕсли;	
		
КонецПроцедуры
		
Функция СоответствуетНормативу()
	
	Возврат КачественныеПоказатели.Количество() = 0 
	        ИЛИ КачественныеПоказатели.НайтиСтроки(Новый Структура("СоответствуетНормативу", Ложь)).Количество() > 0;
	        
КонецФункции

#КонецОбласти

Процедура ИнициализироватьДопПараметры(ДопПараметры)
	
	ДопПараметры.ДополнительныеСвойства = Новый Структура;
	
	Для Каждого ДополнительноеСвойство Из ДополнительныеСвойства Цикл
		ДопПараметры.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДопПараметры(ДопПараметры, ИмяДопРеквизита, ЗначениеДопРеквизита)
	
	ДопПараметры.ДополнительныеСвойства.Вставить(ИмяДопРеквизита, ЗначениеДопРеквизита);
КонецПроцедуры

Процедура СформироватьНаправлениеНаРазгрузкуПриНеобходимости(ДокументРегистрации, ЛабораторныйАнализ, ДатаАнализа, ДопПараметры = Неопределено)  
	
	Если Не (Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен 
		И Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)) Тогда
		Возврат;
	КонецЕсли;
		
	Если ДопПараметры <> Неопределено И Не НазначатьНаСкладыПоПараметрам(ДопПараметры.ДополнительныеСвойства)
		Или Не гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;

	Если РегистрацияЗаблокированаДляРазгрузки()
		Или гкс_ВходнойКонтрольКачества.ТекущийКомпозитныйАнализНеПройденПоКачеству(гкс_ДокументРегистрации) Тогда 

		ТекстСообщения = СтрШаблон(
            	НСтр("ru='Направление на разгрузку не сформировано: регистрация %1 
            	|заблокирована по усиленному контролю/ текущий промежуточный композит на группу 
            	|имеет отрицательное качество'"),
				гкс_ДокументРегистрации);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		ЗаписьЖурналаРегистрации(
		            НСтр("ru='Формирование Направление на разгрузку'"), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.гкс_ЛабораторныйАнализ, ЛабораторныйАнализ, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	гкс_ПриемкаТранспорта.СформироватьНаправлениеНаРазгрузку(ДатаАнализа, ДокументРегистрации, ЛабораторныйАнализ);
	
КонецПроцедуры
	
Функция НазначатьНаСкладыПоПараметрам(Параметры)
	
	ВыполняетсяУсловие = (ТипЗнч(Параметры) = Тип("Структура")) 
	        И Параметры.Свойство("НазначатьНаСклады")
	        И Параметры["НазначатьНаСклады"];

	Возврат ВыполняетсяУсловие;
	
КонецФункции

Функция ЭтоРегистрацияНаПЛК(ДокументСсылка)
	Возврат ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК");
КонецФункции
	
Функция ЭтоФормированиеНомераПроб(ДокументСсылка)
	Возврат ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.гкс_ФормированиеНомераПробы");
КонецФункции   

Процедура СформироватьВспомогательныеДанныеДляЗаблокированныхТС()
	
	Если ЭтоЛабАнализДляЗаблокированныхТС() Тогда
		
		ДанныеДляРазгрузкиРазблокированныхТС = Новый ТаблицаЗначений;
	
		гкс_ВходнойКонтрольКачества.ЗаписатьСостоянияРегистрацииЗаблокированныхТС(Ссылка, 
			гкс_ДокументРегистрации, ДанныеДляРазгрузкиРазблокированныхТС);
			
		// Формируем направления для разгрузки для тех заблокированных ТС, у которых состоние регистрации = Качество принято
		Для Каждого СтрокаДанные из ДанныеДляРазгрузкиРазблокированныхТС цикл	
			СформироватьНаправлениеНаРазгрузкуПриНеобходимости(
				СтрокаДанные.ДокументРегистрации, СтрокаДанные.ЛабораторныйАнализ, СтрокаДанные.Дата);		
		КонецЦикла;
		
	КонецЕсли;
	
	гкс_ВходнойКонтрольКачества.ЗаполнитьЗаблокированныеРегистрацииУсиленныйКонтроль(
			Ссылка, гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);
	
КонецПроцедуры	

Функция ЭтоЛабАнализДляЗаблокированныхТС()
	
	Если Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)
		И гкс_ВходнойКонтрольКачества.ЭтоПерваяРегистрацияТСПоставщика(гкс_ДокументРегистрации) Тогда
		
	    Результат = Истина;
		
	ИначеЕсли Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПромежуточныйКомпозит(гкс_НазначениеИспользованияКачества)
		И ЭтоФормированиеНомераПроб(гкс_ДокументРегистрации) Тогда
		
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции	

Функция НеОжидатьОкончанияАнализаДляВыполнения()
	Возврат ПолучитьФункциональнуюОпцию("гкс_НеОжидатьОкончанияАнализаДляВыполнения");
КонецФункции

Функция РегистрацияЗаблокированаДляРазгрузки()
	
	Возврат ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС")
		И ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества")
		И ЭтоПриемкаПромежуточныйКомпозит()
		И гкс_ВходнойКонтрольКачества.
		ПроверитьБлокированиеТранспортногоСредстваДляРазгрузки(гкс_ДокументРегистрации);
			
КонецФункции                                                                              

Функция ЭтоПриемкаПриемкаКомпозит()
	
	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит);
	
	Возврат Назначения.НайтиПоЗначению(гкс_НазначениеИспользованияКачества) <> Неопределено;
	
КонецФункции  
	
Функция ЭтоПриемкаПромежуточныйКомпозит()
	
	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	
	Возврат Назначения.НайтиПоЗначению(гкс_НазначениеИспользованияКачества) <> Неопределено;
	
КонецФункции 	
		
Функция РегистрацияНеПрошлаКомпозитНаГруппу() Экспорт
	
	Если Не (Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен 
		И Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат гкс_ВходнойКонтрольКачества.ТекущийКомпозитныйАнализНеПройденПоКачеству(гкс_ДокументРегистрации);
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
